bweiler/Skoobot-firmware/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_template/main.c
/*
      Segger IDE and nRF BLE SDK integrated code. Start of project is example in BLE_Peripheral Template. 
      Segger ARM M version: 3.34
      Nordic Semi SDK nRF5 version: 14.2
      Softdevice (BLE stack, linked in as a precompiled hex file) is S132, version:

      Targets are Sparkfun nRF52832 dongle and Tiny Robot
      Tiny Robot has these features:
      1. VLX6180 distance sensor
      2. 2 motors, left and right, driven through 2 TI DRV8834
      3. Microphone
      4. Buzzer
      5. 1 LED
      6. BLE antenna, robot acts as a peripheral
      There is no LF oscillator, just a single 32Mhz crystaL, makes BLE setup non-standard for SDK

      I am using the nRF SDK characteristics battery_level and button/led "lbs"
      Button is the write byte, so it is like data, it is sent with sendoutbyteBLE()
      Led is read byte, so it can be a command, it is in g_jnbyte


*/
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "sdk_common.h"
#include "nrf.h"
#include "app_error.h"
#include "ble.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "nrf_sdh.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdh_ble.h"
#include "app_timer.h"
#include "fds.h"
#include "peer_manager.h"
#include "bsp_btn_ble.h"
#include "sensorsim.h"
#include "ble_conn_state.h"
#include "nrf_ble_gatt.h"
#include "ble_lbs.h"

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"
#include "arm_const_structs.h"
#include "nrf_drv_twi.h"
#include "nrf_delay.h"
#include "vl6180.h"
#include "nrf_drv_pdm.h"

#define APP_FEATURE_NOT_SUPPORTED       BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2    /**< Reply when unsupported features are requested. */

#define DEVICE_NAME                     "Tiny Robot"                       /**< Name of device. Will be included in the advertising data. */
#define MANUFACTURER_NAME               "William Weiler Eng"                   /**< Manufacturer. Will be passed to Device Information Service. */
#define APP_BLE_OBSERVER_PRIO           3                                       /**< Application's BLE observer priority. You shouldn't need to modify this value. */
#define APP_BLE_CONN_CFG_TAG            1                                       /**< A tag identifying the SoftDevice BLE configuration. */

#define APP_ADV_INTERVAL                64                                      /**< The advertising interval (in units of 0.625 ms; this value corresponds to 40 ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS      BLE_GAP_ADV_TIMEOUT_GENERAL_UNLIMITED   /**< The advertising time-out (in units of seconds). When set to 0, we will never time out. */

#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(100, UNIT_1_25_MS)        /**< Minimum acceptable connection interval (0.5 seconds). */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(200, UNIT_1_25_MS)        /**< Maximum acceptable connection interval (1 second). */
#define SLAVE_LATENCY                   0                                       /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)         /**< Connection supervisory time-out (4 seconds). */

#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(20000)                  /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (15 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(5000)                   /**< Time between each call to sd_ble_gap_conn_param_update after the first call (5 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                       /**< Number of attempts before giving up the connection parameter negotiation. */

#define BUTTON_DETECTION_DELAY          APP_TIMER_TICKS(50)                     /**< Delay from a GPIOTE event until a button is reported as pushed (in number of timer ticks). */

#define DEAD_BEEF                       0xDEADBEEF                              /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

BLE_LBS_DEF(m_lbs); 
NRF_BLE_GATT_DEF(m_gatt);                                                       /**< GATT module instance. */

static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;                        /**< Handle of the current connection. */

// Initialize.
static void leds_init(void);
static void timers_init(void);
static void log_init(void);
static void buttons_init(void);
static void ble_stack_init(void);
static void gap_params_init(void);
static void gatt_init(void);
static void services_init(void);
static void advertising_init(void);
static void conn_params_init(void);
static void advertising_start(void);
static void setoutbyteBLE(uint8_t sendbyte);
static void inbyte_handler(uint16_t conn_handle, ble_lbs_t * p_lbs, uint8_t inbyte);
uint8_t g_inbyte = 0;


//Start of my section
//This is just a sparkfun reference I am using to develop code, it should always be 0
#define CB_TEST 0
#define MB_TEST 0
#define SPARKFUN 1
#if CB_TEST
#define SPARKFUN 0
#endif
#if MB_TEST
#define SPARKFUN 0
#endif

#define UART_RX_PIN   26
#define UART_TX_PIN   27


#if SPARKFUN

#define BUZZER_10MM   31

//VLX6180
//SHDN
#define GP0       24
//GPIO
#define GP1       23
#define I2C0_SCL  22
#define I2C0_SDA  20

//microphone
#define MIC_CLK   16
#define MIC_DI    17
#define MIC_SEL   18

//motors
#define M1        3
#define M0        12
#define DIR_L     2
#define STEP      1
#define DIR_R     4

//actually red
#define GREEN_LED 7

#else
//Buzzer
#define BUZZER_10MM   10

//microphone
#define MIC_CLK   28
#define MIC_DI    29
//this is placeholder, mic is tied low
#define MIC_SEL   27

//VLX6180
#define GP0       14
#define GP1       13
#define I2C0_SCL  15
#define I2C0_SDA  16

//motors
#define M1        25
#define M0        23
#define DIR_L     22
#define STEP      30
#define SLEEP     27
#if CB_TEST
#define DIR_R     24
#define GREEN_LED 7
#else
#define DIR_R     26
#define GREEN_LED 2
#endif
#endif

// TWI instance ID. 
#define TWI_INSTANCE_ID 0

/* Indicates if operation on TWI has ended. */
volatile bool m_xfer_done = false;

/* TWI instance. */
const nrf_drv_twi_t m_twi = NRF_DRV_TWI_INSTANCE(TWI_INSTANCE_ID);

/* Buffer for samples read from temperature sensor. */
static uint8_t m_sample;

