bweiler/Skoobot-firmware/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_template/main.c
#define GRAPH_WINDOW_HEIGHT              20                              //!< Graph window height used in draw function.

#define FPU_EXCEPTION_MASK               0x0000009F                      //!< FPU exception mask used to clear exceptions in FPSCR register.
#define FPU_FPSCR_REG_STACK_OFF          0x40                            //!< Offset of FPSCR register stacked during interrupt handling in FPU part stack.

// We want to use 44100 Hz sampling rate to reach 22050Hz band. 128 (64 pairs) samples are used
// in FFT calculation with result contains 64 bins (22050Hz/64bins -> ~344,5Hz per bin).
#define FFT_TEST_SAMPLE_FREQ_HZ          44100.0f                        //!< Frequency of complex input samples.
#define FFT_TEST_COMP_SAMPLES_LEN        128                             //!< Complex numbers input data array size. Correspond to FFT calculation this number must be power of two starting from 2^5 (2^4 pairs) with maximum value 2^13 (2^12 pairs).
//#define FFT_TEST_OUT_SAMPLES_LEN         (FFT_TEST_COMP_SAMPLES_LEN / 2) //!< Output array size.

//#define SIGNALS_RESOLUTION               100.0f                          //!< Sine wave frequency and noise amplitude resolution. To count resolution as decimal places in number use this formula: resolution = 1/SIGNALS_RESOLUTION .
//#define SINE_WAVE_FREQ_MAX               20000                           //!< Maximum frequency of generated sine wave.
//#define NOISE_AMPLITUDE                  1                               //!< Amplitude of generated noise added to signal.

static uint32_t  m_ifft_flag             = 0;                            //!< Flag that selects forward (0) or inverse (1) transform.
static uint32_t  m_do_bit_reverse        = 1;                            //!< Flag that enables (1) or disables (0) bit reversal of output.
static float32_t m_fft_input_f32[FFT_TEST_COMP_SAMPLES_LEN];             //!< FFT input array. Time domain.
static float32_t m_fft_output_f32[FFT_TEST_COMP_SAMPLES_LEN];             //!< FFT output data. Frequency domain.
void afunc(void);
void uart_init(void);
void sendbytes(uint8_t a);
uint8_t sendbuffer[64];
uint8_t recvbuffer[64];
void my_configure(void);
void configure_motors(void);
void motors_forward(void);
void motors_backward(void);
void motors_right(void);
void motors_left(void);
void configure_microphone(void);
void pwm_motor_stepping(uint32_t steps_per_second);
void pwm_buzzer_frequency(float freq);
void configure_VLX6180(void);
void VLX6180_init(void);
void read_sensor_data(void);
void twi_init(void);
void charging(void);
void stop_buzzer(void);
void stop_stepping(void);
void audio_handler(nrf_drv_pdm_evt_t const * const evt);
void cb_test(void);
void mb_test(void);
void stepping_mode(uint8_t mode);
void step_mode_experiment(void);

//#define SAMPLE_BUFFER_CNT 8096
#define SAMPLE_BUFFER_CNT 256
int16_t p_rx_buffer[SAMPLE_BUFFER_CNT];

/**
 * Motor might be 15 degrees per step, so 24 steps per revolution.
 * 83.3rpm = 15ms * 2 = 30ms period, 33Hz/24*60s
 */
int main(void)
{
    static uint8_t flipper = 0, lowhigh  = 0, range, stepmode;
    int16_t i;
    uint32_t cnt, cnt2;
    float freq[8] = { 440.0, 460.0, 470.0, 480.0, 2600, 2300, 2100, 1800 };
    bool erase_bonds = false;
    ret_code_t ret;

    //nrf_gpio_cfg(GREEN_LED,NRF_GPIO_PIN_DIR_OUTPUT,NRF_GPIO_PIN_INPUT_DISCONNECT,NRF_GPIO_PIN_PULLUP,NRF_GPIO_PIN_S0H1,NRF_GPIO_PIN_NOSENSE);

    nrf_gpio_cfg_output(GREEN_LED);
    nrf_gpio_pin_clear(GREEN_LED);
    
    //charging();    
 
    #if SPARKFUN
      uart_init();
    #endif
    #if CB_TEST
      uart_init();
      cb_test();
    #endif
    #if MB_TEST
      mb_test();
    #endif
    
    configure_VLX6180();

    #if SPARKFUN
    configure_microphone();
    #endif

    // Initialize.
    timers_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

    // Start execution.
    advertising_start();

    configure_motors();
    stepping_mode(1);
 
    my_configure();
   
 
    #if SPARKFUN
    //like 6700 samples in p_rx_buffer
    m_xfer_done = false;
    nrf_drv_pdm_buffer_set(p_rx_buffer, SAMPLE_BUFFER_CNT);
    nrf_drv_pdm_start();
    nrf_delay_ms(400);
    nrf_drv_pdm_stop();
    afunc();            //do fft, then check m_fft_output_f32 64 bytes
    #endif
   
    nrf_delay_ms(5000);     //wait 5 seconds, let me connect BLE
  
    //switch interval is 1 second
    cnt = 0;
    for (;;)
    {
        if (g_inbyte == 1)
          cnt = 100;
        else
        {
          if (cnt > 7)
            cnt = 0;
          else
            ++cnt;
        }
        switch(cnt)
        {
          case 1:
            pwm_motor_stepping(150);    //go forward
            //pwm_buzzer_frequency(1000);
            break;
          case 2:
            //pwm_buzzer_frequency(2000);
            stop_stepping();
            motors_right();
            break;
          case 3:
            pwm_motor_stepping(100);    //turn right
            //pwm_buzzer_frequency(3000);
            break;
          case 4:
            stop_stepping();
            motors_forward();
            //stop_buzzer();
            pwm_motor_stepping(200);    //go forward
            break;
          case 5:
            stop_stepping();
            motors_right();
            break;
          case 6:
            pwm_motor_stepping(100);    //turn right
            break;
         case 7:
            stop_stepping();
            motors_forward();
            cnt = 0;
            break;
         default:
            stop_stepping();
            break;
        }
        setoutbyteBLE(cnt);
        range = getDistance();
        if (range <= 50)
        {
          nrf_gpio_pin_clear(GREEN_LED);
        }
        nrf_delay_ms(1000);
        nrf_gpio_pin_set(GREEN_LED);
    
      // if (NRF_LOG_PROCESS() == false)
        {
            //power_manage();
        }
    }  

    while(1)
    {
        nrf_gpio_pin_set(GREEN_LED);
        nrf_delay_ms(300);
        nrf_gpio_pin_clear(GREEN_LED);
        nrf_delay_ms(300);

        do
        {
            __WFE();
        }while (m_xfer_done == false);

        read_sensor_data();
    }   
    configure_motors();
    my_configure();

    pwm_buzzer_frequency(2000);
    //pwm_motor_stepping(2000);
    while(1)
    {
      sendbytes(0);
      afunc();
      nrf_gpio_pin_set(GREEN_LED);
      nrf_delay_ms(4000);
      sendbytes(1);
      nrf_gpio_pin_clear(GREEN_LED);
      nrf_delay_ms(500);

