bweiler/Skoobot-firmware/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_template/main.c
    }
    cnt = 39;
    cnt2 = 0;
    i = 0;
    flipper = 0;
    while(1)
    {
         pwm_buzzer_frequency(freq[i++]);
         if (i == 8)
          i = 0;
  
        nrf_delay_ms(500);
        nrf_gpio_pin_clear(GREEN_LED);
        nrf_delay_ms(500);
        nrf_gpio_pin_set(GREEN_LED);
    }
    
}

void configure_microphone(void)
{
  nrf_gpio_cfg_output(MIC_SEL);
  nrf_gpio_pin_clear(MIC_SEL);    //Select Left Channel

  nrf_drv_pdm_config_t pdm_config = NRF_DRV_PDM_DEFAULT_CONFIG(MIC_CLK,MIC_DI);

  pdm_config.clock_freq = NRF_PDM_FREQ_1067K;
  pdm_config.mode = NRF_PDM_MODE_MONO;
  pdm_config.edge = NRF_PDM_EDGE_LEFTRISING;
  pdm_config.gain_l = NRF_PDM_GAIN_DEFAULT;
  pdm_config.gain_r = NRF_PDM_GAIN_DEFAULT;

  nrf_drv_pdm_init(&pdm_config, audio_handler);
 
  return; 
}

void step_mode_experiment(void)
{
    uint8_t stepmode;

    // Enter main loop.
    stepmode = 0;
    for (;;)
    {
        //for now is 1 second
        stepping_mode(stepmode);
        switch(stepmode)
        {
          case 0:
            pwm_motor_stepping(50);    //go forward
            nrf_gpio_pin_clear(GREEN_LED);
            break;
          case 1:
            pwm_motor_stepping(100);    //go forward
            nrf_gpio_pin_set(GREEN_LED);
            break;
          case 2:
            pwm_motor_stepping(200);    //go forward
            break;
          case 3:
            pwm_motor_stepping(400);    //go forward
            break;
          case 4:
            pwm_motor_stepping(800);    //go forward
            break;
          case 5:
            pwm_motor_stepping(1600);    //go forward
            break;
        }
        ++stepmode;
        if (stepmode == 6)
            stepmode = 0;
        nrf_delay_ms(2000);
        stop_stepping();
        nrf_delay_ms(500);
    }
}

void motors_forward(void)
{
  nrf_gpio_pin_clear(DIR_R);
  nrf_gpio_pin_set(DIR_L);
}

void motors_backward(void)
{
   nrf_gpio_pin_clear(DIR_L);
   nrf_gpio_pin_set(DIR_R);
}

void motors_right(void)
{
   nrf_gpio_pin_clear(DIR_L);
   nrf_gpio_pin_clear(DIR_R);
}

void motors_left(void)
{
   nrf_gpio_pin_set(DIR_L);
   nrf_gpio_pin_set(DIR_R);
}

void stepping_mode(uint8_t mode)
{
    switch(mode)
    {
        case 0:     //full step
          nrf_gpio_cfg_output(M0);
          nrf_gpio_cfg_output(M1);
          nrf_gpio_pin_clear(M0);
          nrf_gpio_pin_clear(M1);
          break;
        case 1:     //1/2 step
          nrf_gpio_cfg_output(M0);
          nrf_gpio_cfg_output(M1);
          nrf_gpio_pin_set(M0);
          nrf_gpio_pin_clear(M1);
          break;
        case 2:     //1/4 step
          nrf_gpio_cfg_input(M0,NRF_GPIO_PIN_NOPULL);
          nrf_gpio_cfg_output(M1);
          nrf_gpio_pin_clear(M1);
          break;
        case 3:     //8 microsteps
          nrf_gpio_cfg_output(M0);
          nrf_gpio_cfg_output(M1);
          nrf_gpio_pin_clear(M0);
          nrf_gpio_pin_set(M1);
          break;
       case 4:     //16 microsteps
          nrf_gpio_cfg_output(M0);
          nrf_gpio_cfg_output(M1);
          nrf_gpio_pin_set(M0);
          nrf_gpio_pin_set(M1);
          break;
       case 5:     //32 microsteps
          nrf_gpio_cfg_input(M0,NRF_GPIO_PIN_NOPULL);
          nrf_gpio_cfg_output(M1);
          nrf_gpio_pin_set(M1);
          break;
      default:      //full step
          nrf_gpio_cfg_output(M0);
          nrf_gpio_cfg_output(M1);
          nrf_gpio_pin_clear(M0);
          nrf_gpio_pin_clear(M1);
          break;
    }
}

void configure_VLX6180(void)
{
    twi_init();
    VLX6180_init();
}

void VLX6180_init(void)
{
    nrf_gpio_cfg_output(GP0);   //power up is chip enable
    nrf_gpio_pin_set(GP0);
    nrf_gpio_cfg_input(GP1,NRF_GPIO_PIN_NOPULL);    //open drain interrupt
  
    VL6180xInit();
    VL6180xDefautSettings();
}

__STATIC_INLINE void data_handler(uint8_t temp)
{

}

void twi_handler(nrf_drv_twi_evt_t const * p_event, void * p_context)
{
    switch (p_event->type)
    {
        case NRF_DRV_TWI_EVT_DONE:
            if (p_event->xfer_desc.type == NRF_DRV_TWI_XFER_RX)
            {
                data_handler(m_sample);
            }
            m_xfer_done = true;
            break;
        default:
            break;
    }
}

void twi_init(void)
{
    ret_code_t err_code;

    const nrf_drv_twi_config_t twi_VLX6180_config = {
       .scl                = I2C0_SCL,
       .sda                = I2C0_SDA,
       .frequency          = NRF_TWI_FREQ_100K,
       .interrupt_priority = APP_IRQ_PRIORITY_HIGH,
       .clear_bus_init     = false
    };

    err_code = nrf_drv_twi_init(&m_twi, &twi_VLX6180_config, NULL, NULL);

    nrf_drv_twi_enable(&m_twi);
}


void audio_handler(nrf_drv_pdm_evt_t const * const evt)
{
    m_xfer_done = true;
}

void pwm_motor_stepping(uint32_t steps_per_second)
{

  volatile static uint32_t pwm_duty[2], cnt_128k;

  cnt_128k = 128000 / steps_per_second;  
  pwm_duty[0] = pwm_duty[1] = cnt_128k / 2;

  NRF_PWM1->COUNTERTOP = (cnt_128k << PWM_COUNTERTOP_COUNTERTOP_Pos); 
  NRF_PWM1->SEQ[0].PTR = pwm_duty;
  NRF_PWM1->SEQ[0].CNT = (1 << PWM_SEQ_CNT_CNT_Pos);
  NRF_PWM1->TASKS_SEQSTART[0] = 1;   
}

//125000/freq=    125000/250
void pwm_buzzer_frequency(float freq)
{
  float main_freq;
  volatile static uint16_t pwm_top, pwm_duty[2];
   
  main_freq = 125000.0 / freq;

  pwm_top = (uint16_t)main_freq;
  pwm_duty[0] = pwm_duty[1] = (uint16_t)(main_freq / 2.0);

  NRF_PWM0->COUNTERTOP = (pwm_top << PWM_COUNTERTOP_COUNTERTOP_Pos); //1 msec
  NRF_PWM0->SEQ[0].PTR = (uint32_t)(pwm_duty);
  NRF_PWM0->SEQ[0].CNT = (1 << PWM_SEQ_CNT_CNT_Pos);
  NRF_PWM0->TASKS_SEQSTART[0] = 1;   
}

void cb_test(void)
{
  configure_motors();
  my_configure();

  for(;;)
  {
    nrf_gpio_pin_clear(GREEN_LED);
    pwm_motor_stepping(200);
    nrf_delay_ms(2000);
    stop_motors();
    nrf_gpio_pin_set(GREEN_LED);
    nrf_delay_ms(2000);
  }

}

void mb_test(void)
{
  configure_motors();
  nrf_gpio_cfg_output(MIC_CLK);
  nrf_gpio_cfg_output(MIC_DI);
  nrf_gpio_cfg_output(MIC_SEL);
  
  for(;;)
  {
    nrf_gpio_pin_clear(GREEN_LED);
    nrf_gpio_pin_clear(STEP);
    nrf_gpio_pin_clear(DIR_L);
    nrf_gpio_pin_clear(DIR_R);
    nrf_gpio_pin_clear(M1);
    nrf_gpio_pin_clear(M0);
    nrf_gpio_pin_clear(MIC_CLK);
    nrf_gpio_pin_clear(MIC_DI);
    nrf_gpio_pin_clear(MIC_SEL);
    nrf_delay_ms(500);
    nrf_gpio_pin_set(GREEN_LED);
    nrf_gpio_pin_set(STEP);
    nrf_gpio_pin_set(DIR_L);
    nrf_gpio_pin_set(DIR_R);
    nrf_gpio_pin_set(M1);
    nrf_gpio_pin_set(M0);
    nrf_gpio_pin_set(MIC_CLK);
    nrf_gpio_pin_set(MIC_DI);
    nrf_gpio_pin_set(MIC_SEL);
    nrf_delay_ms(500);
  }

